Week_MidtermExam/MidtermExam/app/Controllers/CourseController.php

    public function update($id)
    {
        $rules = [
            'course_code' => "required|is_unique[courses.course_code,id,{$id}]",
            'course_name' => 'required',
            'credits'     => 'required|integer'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->courseModel->update($id, [
            'course_code' => $this->request->getVar('course_code'),
            'course_name' => $this->request->getVar('course_name'),
            'credits'     => $this->request->getVar('credits'),
        ]);
---
UPDATE `courses` SET `course_code` = 'IF101', `course_name` = 'Algoritma dan Pemrograman', `credits` = '3'
WHERE `courses`.`id` IN ('1')