Week_MidtermExam/MidtermExam/app/Controllers/GudangController.php

SELECT *
FROM `bahan_baku`
ORDER BY `tanggal_kadaluarsa` ASC
---
    public function index()
    {
        $bahanBakuModel = new BahanBakuModel();

        // menyiapkan data untuk dikirim ke view
        $data = [
            'title'      => 'Stok Bahan Baku',
            'bahan_baku' => $bahanBakuModel->orderBy('tanggal_kadaluarsa', 'ASC')->findAll(),
        ];