Week_MidtermExam/MidtermExam/app/Controllers/LoginController.php

    public function process()
    {
        $session = session();
        $model = new UserModel();

        // mengambil email dan password dari form login
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        // mencari pengguna dari email
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'dewi.dapur@mbg.id'
 LIMIT 1