Week_5/W5_Task1_DomJS/app/Controllers/DashboardController.php

SELECT *
FROM `students`
JOIN `users` ON `users`.`id` = `students`.`user_id`
WHERE `user_id` = '9'
 LIMIT 1
---
    public function myDetail()
    {
        // 1. Dapatkan user_id dari session
        $userId = session()->get('user_id');

        // 2. Cari data student berdasarkan user_id menggunakan method yang sudah ada
        $student = $this->studentModel->where('user_id', $userId)->join('users', 'users.id = students.user_id')->first();

SELECT *
FROM `students`
WHERE `user_id` = '11'
 LIMIT 1
---
    public function myCourses()
    {
        // 1. Dapatkan user_id dari session
        $userId = session()->get('user_id');

        // 2. Cari data student berdasarkan user_id
        $student = $this->studentModel->where('user_id', $userId)->first();

SELECT *
FROM `students`
WHERE `user_id` = '11'
 LIMIT 1
SELECT *
FROM `courses`
---
    public function enroll()
    {
        $student = $this->studentModel->where('user_id', session()->get('user_id'))->first();
        if (!$student) {
            return redirect()->to('/home')->with('error', 'Data mahasiswa tidak ditemukan.');
        }

        $enrolled_courses = $this->studentModel->getCoursesByStudentId($student['id']);

        $data = [
            'title'               => 'Ubah Jadwal Mata Kuliah',
            'all_courses'         => $this->courseModel->findAll(),

SELECT *
FROM `students`
WHERE `user_id` = '11'
 LIMIT 1
---
    public function saveEnrollment()
    {
        $student = $this->studentModel->where('user_id', session()->get('user_id'))->first();