Week_5/W5_Task1_DomJS/app/Controllers/LoginController.php

    public function process()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'ihsan'
 LIMIT 1