Week_5/W5_Task1_DomJS/app/Models/StudentModel.php

    public function getStudentsWithUser()
    {
        return $this->select('students.*, users.full_name, users.username')
            ->join('users', 'users.id = students.user_id')
            ->where('users.role', 'mahasiswa')
            ->orderBy('students.id', 'ASC')
            ->findAll();
---
SELECT `students`.*, `users`.`full_name`, `users`.`username`
FROM `students`
JOIN `users` ON `users`.`id` = `students`.`user_id`
WHERE `users`.`role` = 'mahasiswa'
ORDER BY `students`.`id` ASC

    public function getCoursesByStudentId($student_id)
    {
        // Query ini akan:
        // 1. Memilih semua kolom dari tabel 'courses'
        // 2. Bergabung dengan tabel 'takes'
        // 3. Menyaring hasilnya hanya untuk student_id yang spesifik
        return $this->db->table('courses')
            ->select('courses.*, takes.enroll_date') // Ambil juga tgl enroll
            ->join('takes', 'takes.course_id = courses.id')
            ->where('takes.student_id', $student_id)
            ->get()
            ->getResultArray();
---
SELECT `courses`.*, `takes`.`enroll_date`
FROM `courses`
JOIN `takes` ON `takes`.`course_id` = `courses`.`id`
WHERE `takes`.`student_id` = '11'

    public function updateEnrollments($student_id, $course_ids = [])
    {
        $takesTable = $this->db->table('takes');
        $this->db->transStart();
        $takesTable->where('student_id', $student_id)->delete();

        if (!empty($course_ids)) {
            $dataToInsert = [];
            foreach ($course_ids as $course_id) {
                $dataToInsert[] = [
                    'student_id'  => $student_id,
                    'course_id'   => $course_id,
                    'enroll_date' => date('Y-m-d')
                ];
            }
            $takesTable->insertBatch($dataToInsert);
---
DELETE FROM `takes`
WHERE `student_id` = '11'
INSERT INTO `takes` (`course_id`, `enroll_date`, `student_id`)
VALUES ('1','2025-09-23','11'), ('4','2025-09-23','11'), ('6','2025-09-23','11'), ('7','2025-09-23','11'), ('8','2025-09-23','11'), ('9','2025-09-23','11'), ('10','2025-09-23','11'), ('12','2025-09-23','11'), ('15','2025-09-23','11')