Week_3/W3_Task4_FormLoginCRUD/app/Models/mahasiswamodel.php

SELECT *
FROM `mahasiswa`
ORDER BY `id` ASC
---
    public function getAllMahasiswa()
    {
        return $this->orderBy('id', 'ASC')->findAll();