MBG_241511079_2C_Ibnu Hilmi Athaillah/MBG_241511079_2C_Ibnu Hilmi Athaillah/app/Models/BahanBakuModel.php

    public function getAllWithCalculatedStatus()
    {
        $allBahan = $this->orderBy('tanggal_kadaluarsa', 'ASC')->findAll();
---
SELECT *
FROM `bahan_baku`
ORDER BY `tanggal_kadaluarsa` ASC