MBG_241511079_2C_Ibnu Hilmi Athaillah/MBG_241511079_2C_Ibnu Hilmi Athaillah/app/Models/PermintaanModel.php

    public function getRequestsWithDetails($statusFilter = null)
    {
        // 1. Ambil data permintaan utama, gabungkan dengan nama pemohon
        $builder = $this->select('permintaan.*, user.name as pemohon_nama')
                        ->join('user', 'user.id = permintaan.pemohon_id');

        // Jika ada filter status (misal: hanya 'menunggu'), terapkan
        if ($statusFilter) {
            $builder->where('permintaan.status', $statusFilter);
        }

        $permintaan_list = $builder->orderBy('permintaan.created_at', 'DESC')->findAll();

        // Jika tidak ada permintaan, kembalikan array kosong
        if (empty($permintaan_list)) {
            return [];
        }

        // 2. Ambil semua ID permintaan untuk query detail
        $permintaanIds = array_column($permintaan_list, 'id');

        // 3. Ambil semua detail bahan untuk semua permintaan di atas dalam satu query
        $detailModel = new PermintaanDetailModel();
        $details = $detailModel->select('permintaan_detail.*, bahan_baku.nama as nama_bahan, bahan_baku.satuan')
                               ->join('bahan_baku', 'bahan_baku.id = permintaan_detail.bahan_id')
                               ->whereIn('permintaan_detail.permintaan_id', $permintaanIds)
                               ->findAll();
---
SELECT `permintaan`.*, `user`.`name` as `pemohon_nama`
FROM `permintaan`
JOIN `user` ON `user`.`id` = `permintaan`.`pemohon_id`
ORDER BY `permintaan`.`created_at` DESC
SELECT `permintaan_detail`.*, `bahan_baku`.`nama` as `nama_bahan`, `bahan_baku`.`satuan`
FROM `permintaan_detail`
JOIN `bahan_baku` ON `bahan_baku`.`id` = `permintaan_detail`.`bahan_id`
WHERE `permintaan_detail`.`permintaan_id` IN ('13','12','11','10','9','8','7','6','5','4','3','2','1')