Week_3/W3_Task3_LoginLogout/app/Models/mahasiswamodel.php

SELECT *
FROM `mahasiswa`
WHERE `nim` = '241511000'
 LIMIT 1
---
    public function getMahasiswaByNim($nim)
    {
        return $this->where('nim', $nim)->first();