MBG_241511079_2C_Ibnu Hilmi Athaillah/MBG_241511079_2C_Ibnu Hilmi Athaillah/app/Controllers/DapurController.php

    public function index()
    {
        $permintaanModel = new PermintaanModel();
        $bahanBakuModel = new BahanBakuModel(); // <-- TAMBAHKAN INI

        // Ambil data bahan baku yang statusnya BUKAN kadaluarsa dan jumlahnya DI ATAS 0
        $bahanTersedia = $bahanBakuModel->where('status !=', 'kadaluarsa')
                                        ->where('jumlah >', 0)
                                        ->orderBy('nama', 'ASC')
                                        ->findAll();

        // Ambil data riwayat permintaan seperti sebelumnya
        $riwayatPermintaan = $permintaanModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `permintaan`
ORDER BY `created_at` DESC

    public function newRequest()
    {
        $bahanBakuModel = new BahanBakuModel();
        $data = [
            'title' => 'Buat Permintaan Bahan Baru',
            // Ambil hanya bahan yang statusnya tersedia/segera kadaluarsa
            'bahan_list' => $bahanBakuModel->whereIn('status', ['tersedia', 'segera_kadaluarsa'])
                                           ->where('jumlah >', 0)
                                           ->orderBy('nama', 'ASC')
                                           ->findAll()
---
SELECT *
FROM `bahan_baku`
WHERE `status` IN ('tersedia','segera_kadaluarsa')
AND `jumlah` > 0
ORDER BY `nama` ASC