MBG_241511079_2C_Ibnu Hilmi Athaillah/MBG_241511079_2C_Ibnu Hilmi Athaillah/app/Controllers/GudangController.php

SELECT *
FROM `permintaan_detail`
WHERE `permintaan_id` = '9'
SELECT *
FROM `bahan_baku`
WHERE `bahan_baku`.`id` = '1'
---
    public function approveRequest($id)
    {
        $permintaanModel = new PermintaanModel();
        $permintaanDetailModel = new PermintaanDetailModel();
        $bahanBakuModel = new BahanBakuModel();
        $db = \Config\Database::connect();

        $requestedItems = $permintaanDetailModel->where('permintaan_id', $id)->findAll();

        // LANGKAH 1: Cek semua bahan terlebih dahulu
        $insufficientItems = []; // Siapkan wadah untuk bahan yang kurang
        foreach ($requestedItems as $item) {
            $bahan = $bahanBakuModel->find($item['bahan_id']);