MBG_241511079_2C_Ibnu Hilmi Athaillah/MBG_241511079_2C_Ibnu Hilmi Athaillah/app/Controllers/GudangController.php

    public function index()
    {
        $bahanBakuModel = new BahanBakuModel();
        $data = [
            'title'      => 'Stok Bahan Baku',
            'bahan_baku' => $bahanBakuModel->orderBy('tanggal_kadaluarsa', 'ASC')->findAll(),
        ];
---
SELECT *
FROM `bahan_baku`
ORDER BY `tanggal_kadaluarsa` ASC